{
  "header": {
    "ABOUTME": "Über mich",
    "SKILLS": "Skills",
    "PROJECTS": "Projekte"
  },
  "sectionOne": {
    "jobTitle": "Frontend Entwickler",
    "toprojects": "Meine Projekte",
    "contactMe": "Schreib Mir"
  },
  "sectionTwo": {
    "whoIAm": "Wer bin ich",
    "aboutMe": "Über mich",
    "greetings": "Hallo, ich bin ein Frontend-Entwickler aus Bad Nauheim und arbeite auf Deutsch. Begeistert von den unendlichen Chancen der IT, gestalte ich gerne attraktive und benutzerfreundliche Websites sowie Anwendungen.",
    "location": "Ich passe mich flexibel an verschiedene Arbeitsumgebungen an und kann sowohl im Büro als auch im Homeoffice produktiv arbeiten. Dennoch bevorzuge ich die Zusammenarbeit vor Ort.",
    "mindset": "Ich bin offen für Neues und suche stets nach persönlichen Herausforderungen, um mein Wissen und meine Fähigkeiten kontinuierlich weiterzuentwickeln.",
    "goal": "Programmieren ist für mich weit mehr als nur das Schreiben von Code – es ist eine kreative Art, Probleme zu lösen. Ich freue mich, komplexe technische Fragestellungen in verständliche und anwenderfreundliche Lösungen zu überführen. So unterstütze ich Sie dabei, Ihre Ziele zu verwirklichen und Ihre Visionen Realität werden zu lassen."
  },
  "sectionThree": {
    "tec": "Technologien",
    "tecText": "Mein Weg führte mich durch vielfältige Projekte, in denen ich verschiedene Frontend-Technologien und -Ansätze erfolgreich eingesetzt habe. Ich bin stets offen für neue Technologien und Methoden, um meine Fähigkeiten weiterzuentwickeln und in der dynamischen Welt der Webentwicklung stets am Puls der Zeit zu bleiben.",
    "youNeed": "Brauchen Sie",
    "otherSkills": "andere Fähigkeiten?",
    "contactMe": "Kontaktieren Sie mich gerne. Ich freue mich darauf mein Wissen zu erweitern.",
    "letsTalk": "Lass uns reden",
    "greaterInterest": "Ich habe besonderes Interesse an"
  },
  "sectionFour": {
    "myProjects": "Meine Projekte",
    "porjectsIntro": "Entdecken Sie hier eine Auswahl meiner Arbeiten – interagieren Sie mit den Projekten, um sie auszuprobieren.",
    "projects": {
      "join": {
        "id": "01",
        "title": "Join",
        "description": "Aufgabenmanager inspiriert vom Kanban-System. Erstellen und organisieren Sie Aufgaben per Drag & Drop und weisen Sie Benutzer und Kategorien zu.",
        "technologies": {
          "tec1": "JavaScript",
          "tec2": "HTML",
          "tec3": "CSS",
          "tec4": "Firebase"
        },
        "image": "./assets/img/project-join.png",
        "urlP": "https://www.lukas-schroeer.developerakademie.net/join/login/login.html",
        "urlGit": "#"
      },
      "polloLoco": {
        "id": "02",
        "title": "Pollo loco",
        "description": "Objektorientiertes Sprung-, Lauf- und Wurfspiel. Hilf Pepe, Münzen und Tabasco-Salsa zu finden, um gegen die verrückte Henne zu kämpfen.",
        "technologies": {
          "tec1": "JavaScript",
          "tec2": "HTML",
          "tec3": "CSS"
        },
        "image": "./assets/img/project-pollo.png",
        "urlP": "https://www.lukas-schroeer.developerakademie.net/Z_EL_POLLO_LOCO_2/index.html",
        "urlGit": "#"
      },
      "pokedex": {
        "id": "03",
        "title": "Pokédex",
        "description": "Ein interaktiver Pokédex mit Verbindung zu einer REST-API. Erkundet die große Welt der Pokemon und begebt euch auf eine nostalgische Reise.",
        "technologies": {
          "tec1": "JavaScript",
          "tec2": "HTML",
          "tec3": "CSS",
          "tec4": "REST API"
        },
        "image": "./assets/img/project-pokedex.png",
        "urlP": "https://www.lukas-schroeer.developerakademie.net/pokedex/index.html",
        "urlGit": "#"
      }
    },
    "projectIntro": "Worum geht es in diesem Projekt?",
    "nextProject": "Nächstes Projekt"
  },
  "sectionFive": {
    "headline": "Was meine Kollegen über mich sagen",
    "qoutes": {
      "qouteOne": {
        "qoute": "Lukas hat sich als zuverlässiger Partner der Gruppe erwiesen. Seine technischen Fähigkeiten und seine proaktive Herangehensweise waren entscheidend für den Erfolg unseres Projekts.",
        "coworker": "Kol Lege - Frontend Developer"
      },
      "qouteTwo": {
        "qoute": "Lukas hat sich als zuverlässiger Partner der Gruppe erwiesen. Seine technischen Fähigkeiten und seine proaktive Herangehensweise waren entscheidend für den Erfolg unseres Projekts.",
        "coworker": "Kol Lege - Frontend Developer"
      },
      "qouteThree": {
        "qoute": "Lukas hat sich als zuverlässiger Partner der Gruppe erwiesen. Seine technischen Fähigkeiten und seine proaktive Herangehensweise waren entscheidend für den Erfolg unseres Projekts.",
        "coworker": "Kol Lege - Frontend Developer"
      },
      "qouteFour": {
        "qoute": "Lukas hat sich als zuverlässiger Partner der Gruppe erwiesen. Seine technischen Fähigkeiten und seine proaktive Herangehensweise waren entscheidend für den Erfolg unseres Projekts.",
        "coworker": "Kol Lege - Frontend Developer"
      }
    }
  },
  "sectionSix": {
    "contactMe": "Schreiben Sie mir",
    "together": "Gemeinsam ans Werk",
    "problem": "Brauchen Sie Hilfe bei einem Problem?",
    "formIntro": "Kontaktieren Sie mich über dieses Formular, ich freue mich, von Ihnen zu hören, Ihre Ideen zu erfahren und zu Ihren Projekten beizutragen.",
    "inNeed": " Brauchen Sie einen Frontend-Entwickler?",
    "letsTalk": "Reden wir drüber!",
    "form": {
      "name": "Wie ist Ihr Name?",
      "namePH": "Ihr Name kommt hierhin",
      "mail": "Wie lautet Ihre E-Mail?",
      "mailPH": "ihreemail@email.com",
      "matter": "Wie kann ich Ihnen helfen?",
      "matterPH": "Hallo Lukas, ich bin interessiert an ...",
      "legalNotice1": "Ich habe die ",
      "legalNotice2": "Datenschutzerklärung ",
      "legalNotice3": "gelesen und stimme der Verarbeitung meiner Daten gemäß den Angaben zu.",
      "send": "Nachricht senden",
      "nameWarning": "Bitte geben Sie Ihren Namen ein!",
      "emailWarning": "Bitte geben Sie Ihre E-Mail ein!",
      "invalidMail": "Bitte prüfen Sie noch einmal Ihre E-Mail Adresse.",
      "messageWarning": "Bitte geben Sie ein Anliegen ein!",
      "termsWarning": "Bitte akzeptieren sie die Datenschutzerklärung.",
      "success": "Erfolgreich versendet!"
    }
  },
  "imprint": {
    "headline": "Impressum",
    "legal": "Angaben gemäß § 5 DDG",
    "name": "Lukas Schröer",
    "street": "Kurstraße 1",
    "city": "61231 Bad Nauheim",
    "by": "Vertreten durch",
    "contact": "Kontakt",
    "phone": "Telefon: 015771159334",
    "email": "kontakt@lukas-schroeer.de",
    "disclaimer": "Haftungsausschluss",
    "content": "Haftung für Inhalte",
    "contentText": " Die Inhalte unserer Seiten wurden mit größter Sorgfalt erstellt. Für die Richtigkeit, Vollständigkeit und Aktualität der Inhalte können wir jedoch keine Gewähr übernehmen. Als Diensteanbieter sind wir gemäß § 7 Abs.1 DDG für eigene Inhalte auf diesen Seiten nach den allgemeinen Gesetzen verantwortlich. Nach §§ 8 bis 10 DDG sind wir als Diensteanbieter jedoch nicht verpflichtet, übermittelte oder gespeicherte fremde Informationen zu überwachen oder nach Umständen zu forschen, die auf eine rechtswidrige Tätigkeit hinweisen. Verpflichtungen zur Entfernung oder Sperrung der Nutzung von Informationen nach den allgemeinen Gesetzen bleiben hiervon unberührt. Eine diesbezügliche Haftung ist jedoch erst ab dem Zeitpunkt der Kenntnis einer konkreten Rechtsverletzung möglich. Bei Bekanntwerden von entsprechenden Rechtsverletzungen werden wir diese Inhalte umgehend entfernen.",
    "links": "Haftung für Links",
    "linksText": " Unser Angebot enthält Links zu externen Webseiten Dritter, auf deren Inhalte wir keinen Einfluss haben. Deshalb können wir für diese fremden Inhalte auch keine Gewähr übernehmen. Für die Inhalte der verlinkten Seiten ist stets der jeweilige Anbieter oder Betreiber der Seiten verantwortlich. Die verlinkten Seiten wurden zum Zeitpunkt der Verlinkung auf mögliche Rechtsverstöße überprüft. Rechtswidrige Inhalte waren zum Zeitpunkt der Verlinkung nicht erkennbar. Eine permanente inhaltliche Kontrolle der verlinkten Seiten ist jedoch ohne konkrete Anhaltspunkte einer Rechtsverletzung nicht zumutbar. Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Links umgehend entfernen.",
    "copyright": "Urheberrecht",
    "copyrightText": " Die durch die Seitenbetreiber erstellten Inhalte und Werke auf diesen Seiten unterliegen dem deutschen Urheberrecht. Die Vervielfältigung, Bearbeitung, Verbreitung und jede Art der Verwertung außerhalb der Grenzen des Urheberrechtes bedürfen der schriftlichen Zustimmung des jeweiligen Autors bzw. Erstellers. Downloads und Kopien dieser Seite sind nur für den privaten, nicht kommerziellen Gebrauch gestattet. Soweit die Inhalte auf dieser Seite nicht vom Betreiber erstellt wurden, werden die Urheberrechte Dritter beachtet. Insbesondere werden Inhalte Dritter als solche gekennzeichnet. Sollten Sie trotzdem auf eine Urheberrechtsverletzung aufmerksam werden, bitten wir um einen entsprechenden Hinweis. Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Inhalte umgehend entfernen.",
    "data": "Datenschutz",
    "dataText": "Die Nutzung unserer Webseite ist in der Regel ohne Angabe personenbezogener Daten möglich. Soweit auf unseren Seiten personenbezogene Daten (beispielsweise Name, Anschrift oder eMail-Adressen) erhoben werden, erfolgt dies, soweit möglich, stets auf freiwilliger Basis. Diese Daten werden ohne Ihre ausdrückliche Zustimmung nicht an Dritte weitergegeben. Wir weisen darauf hin, dass die Datenübertragung im Internet (z.B. bei der Kommunikation per E-Mail) Sicherheitslücken aufweisen kann. Ein lückenloser Schutz der Daten vor dem Zugriff durch Dritte ist nicht möglich. Der Nutzung von im Rahmen der Impressumspflicht veröffentlichten Kontaktdaten durch Dritte zur Übersendung von nicht ausdrücklich angeforderter Werbung und Informationsmaterialien wird hiermit ausdrücklich widersprochen. Die Betreiber der Seiten behalten sich ausdrücklich rechtliche Schritte im Falle der unverlangten Zusendung von Werbeinformationen, etwa durch Spam-Mails, vor.",
    "reference": {
      "buildBy": "Erstellt mit dem ",
      "generatorLink": "Impressum-Generator ",
      "Guide": " von WebsiteWissen.com, dem Ratgeber für",
      "websiteLink": "Website-Erstellung",
      "homepageLink":"Homepage-Baukästen",
      "and": "und ",
      "shopsLink": "Shopsysteme",
      "legalText": "Rechtstext von der ",
      "lawFirm": "Kanzlei Hasselbach"
    },
    "date": "Stand 12.08.2025"
  }
}