{
  "header": {
    "ABOUTME": "About me",
    "SKILLS": "Skills",
    "PROJECTS": "Projects"
  },
  "sectionOne": {
    "jobTitle": "Frontend Developer",
    "toprojects": "My Projects",
    "contactMe": "Contact Me"
  },
  "sectionTwo": {
    "whoIAm": "Who I Am",
    "aboutMe": "About me",
    "greetings": "Hello, I am a German-speaking frontend developer based in Bad Nauheim. Inspired by the limitless opportunities in IT, I enjoy creating visually appealing and intuitive websites and applications.",
    "location": "I am adaptable to different work environments and work effectively both on-site and remotely. However, I prefer collaborating in person on-site.",
    "mindset": "I am open-minded and constantly seek personal challenges to continuously enhance my knowledge and skills.",
    "goal": "For me, programming is much more than just writing code—it is a creative way to solve problems. I enjoy translating complex technical issues into understandable and user-friendly solutions. In this way, I support you in achieving your goals and turning your visions into reality."
  },
  "sectionThree": {
    "tec": "Technologies",
    "tecText": "My journey has taken me through diverse projects where I applied a wide range of frontend technologies and concepts. I remain open to new technologies and approaches to continuously enhance my skills and stay ahead in the ever-evolving field of web development.",
    "youNeed": "Do you need",
    "otherSkills": "other skills?",
    "contactMe": "Please feel free to contact me. I look forward to expanding my knowledge.",
    "letsTalk": "Let´s talk",
    "greaterInterest": "I am particularly interested in"
  },
  "sectionFour": {
    "myProjects": "Featured Projects",
    "porjectsIntro": "Discover a selection of my work here – interact with the projects to test them out.",
    "projects": {
      "join": {
        "id": "01",
        "title": "Join",
        "description": "Task manager inspired by the Kanban system. Create and organize tasks using drag & drop and assign users and categories.",
        "technologies": {
          "tec1": "JavaScript",
          "tec2": "HTML",
          "tec3": "CSS",
          "tec4": "Firebase"
        },
        "image": "./assets/img/project-join.png",
        "urlP": "https://www.lukas-schroeer.developerakademie.net/join/login/login.html",
        "urlGit": "#"
      },
      "polloLoco": {
        "id": "02",
        "title": "Pollo loco",
        "description": "Object-oriented jumping, running, and throwing game. Help Pepe find coins and Tabasco salsa to fight the crazy hen.",
        "technologies": {
          "tec1": "JavaScript",
          "tec2": "HTML",
          "tec3": "CSS"
        },
        "image": "./assets/img/project-pollo.png",
        "urlP": "https://www.lukas-schroeer.developerakademie.net/Z_EL_POLLO_LOCO_2/index.html",
        "urlGit": "#"
      },
      "pokedex": {
        "id": "03",
        "title": "Pokédex",
        "description": "An interactive Pokédex connected to a REST API. Explore the vast world of Pokémon and embark on a nostalgic journey.",
        "technologies": {
          "tec1": "JavaScript",
          "tec2": "HTML",
          "tec3": "CSS",
          "tec4": "REST API"
        },
        "image": "./assets/img/project-pokedex.png",
        "urlP": "https://www.lukas-schroeer.developerakademie.net/pokedex/index.html",
        "urlGit": "#"
      }
    },
    "projectIntro": "What is this project about?",
    "nextProject": "Next project"
  },
  "sectionFive": {
    "headline": "What my colleagues say about me",
    "qoutes": {
      "qouteOne": {
        "qoute": "Lukas has proven himself to be a reliable partner to the group. His technical skills and proactive approach were crucial to the success of our project.",
        "coworker": "Co Worker - Frontend Developer"
      },
      "qouteTwo": {
        "qoute": "Lukas has proven himself to be a reliable partner to the group. His technical skills and proactive approach were crucial to the success of our project.",
        "coworker": "Co Worker - Frontend Developer"
      },
      "qouteThree": {
        "qoute": "Lukas has proven himself to be a reliable partner to the group. His technical skills and proactive approach were crucial to the success of our project.",
        "coworker": "Co Worker - Frontend Developer"
      },
      "qouteFour": {
        "qoute": "Lukas has proven himself to be a reliable partner to the group. His technical skills and proactive approach were crucial to the success of our project.",
        "coworker": "Co Worker - Frontend Developer"
      }
    }
  },
  "sectionSix": {
    "contactMe": "Contact me",
    "together": "Let's work together",
    "problem": "Got a problem to solve?",
    "formIntro": "Please contact me using this form. I look forward to hearing from you, learning about your ideas, and contributing to your projects.",
    "inNeed": "Need a front-end developer?",
    "letsTalk": "Let's talk about it!",
    "form": {
      "name": "What is your name?",
      "namePH": "Your name goes here",
      "mail": "What is your email address?",
      "mailPH": "youremail@email.com",
      "matter": "How can I help you?",
      "matterPH": "Hello Lukas, I am interested in ...",
      "legalNotice1": "I have read the ",
      "legalNotice2": "Privacy Policy ",
      "legalNotice3": "and consent to the processing of my data in accordance with the information provided.",
      "send": "Send message",
      "nameWarning": "Please enter your Name!",
      "emailWarning": "Please enter your E-Mail!",
      "messageWarning": "Please enter a message!"
    }
  },
  "imprint": {
    "headline": "Imprint",
    "legal": "Information pursuant to § 5 DDG",
    "name": "Lukas Schröer",
    "street": "Kurstraße 1",
    "city": "61231 Bad Nauheim",
    "by": "Represented by",
    "contact": "Contact",
    "phone": "Phone: 015771159334",
    "email": "kontakt@lukas-schroeer.de",
    "disclaimer": "Disclaimer",
    "content": "Liability for content",
    "contentText": " The content of our website has been compiled with the utmost care. However, we cannot guarantee that the content is accurate, complete, or up to date. As a service provider, we are responsible for our own content on this website in accordance with § 7 para. 1 DDG (German Telemedia Act) and general laws. However, according to §§ 8 to 10 DDG, we as a service provider are not obliged to monitor transmitted or stored third-party information or to investigate circumstances that indicate illegal activity. Obligations to remove or block the use of information in accordance with general laws remain unaffected by this. However, liability in this regard is only possible from the time of knowledge of a specific legal violation. Upon becoming aware of such legal violations, we will remove this content immediately.",
    "links": "Liability for links",
    "linksText": "Our website contains links to external third-party websites over whose content we have no influence. Therefore, we cannot accept any liability for this external content. The respective provider or operator of the linked pages is always responsible for their content. The linked pages were checked for possible legal violations at the time of linking. No illegal content was identified at the time of linking. However, permanent monitoring of the content of the linked pages is not reasonable without concrete evidence of a violation of the law. If we become aware of any violations of the law, we will remove such links immediately.",
    "copyright": "Copyright",
    "copyrightText": "The content and works on these pages created by the site operators are subject to German copyright law. The reproduction, editing, distribution, and any kind of use outside the limits of copyright law require the written consent of the respective author or creator. Downloads and copies of this site are only permitted for private, non-commercial use. Insofar as the content on this site was not created by the operator, the copyrights of third parties are respected. In particular, third-party content is identified as such. Should you nevertheless become aware of a copyright infringement, please inform us accordingly. If we become aware of any infringements, we will remove such content immediately.",
    "data": "Data Protection",
    "dataText": "As a rule, it is possible to use our website without providing personal data. Insofar as personal data (e.g. name, address or email addresses) is collected on our website, this is always done on a voluntary basis as far as possible. This data will not be passed on to third parties without your express consent. We would like to point out that data transmission over the Internet (e.g., when communicating by email) can have security gaps. Complete protection of data against access by third parties is not possible. We hereby expressly object to the use of contact data published within the scope of the imprint obligation by third parties for the purpose of sending unsolicited advertising and information materials. The operators of the website expressly reserve the right to take legal action in the event of unsolicited advertising information being sent, for example through spam emails.",
    "reference": {
      "buildBy": "Created with the ",
      "generatorLink": "legal notice generator ",
      "Guide": "from WebsiteWissen.com, the guide to ",
      "websiteLink": "website creation",
      "homepageLink": "website builders",
      "and": "and ",
      "shopsLink": "shop systems",
      "legalText": "Legal text from the ",
      "lawFirm": "Hasselbach law firm"
    },
    "date": "As of August 12, 2025"
  }
}